"""JSON templates."""

JSON_PLAN_TEMPLATE = {
    "Введение": [],
    "Глава 1. Основные положения ликвидации юридических лиц": [
        "1.1. Основания и способы ликвидации юридических лиц.",
        "1.2. Ликвидация вследствие признания организации (юридического лица) банкротом."
    ],
    "Глава 2. Порядок ликвидации": [
        "2.1. Процедура ликвидации юридического лица.",
        "2.2. Выплаты денежных сумм кредиторам. Завершение ликвидации."
    ],
    "Глава 3. Проблемные вопросы ликвидации юридических лиц": [
        "3.1. Новеллы в ликвидации юридических лиц",
        "3.2. Основные проблемы при ликвидации юридических лиц."
    ],
    "Заключение": [],
    "Список используемой литературы": []
}
