"""Сообщения для пользователя при заказе дипломной работы."""

DIPLOMA_WELCOME_MESSAGE = (
    "Дипломная работа, отлично!\n"
    "Дальше мы пройдемся по вопросам, которые помогут нам составить все качественно, если считаешь некоторые из них" 
    "ненужными - можно пропускать.\n"
    ""
)
DIPLOMA_ASK_THEME = (
    "Какая тема у этой дипломной работы?"
)
DIPLOMA_ASK_WORK_SIZE = (
    "Отлично, теперь давай определимся с объемом работы. "
    "Пожалуйста, количество страниц, которое ты считаешь оптимальным."
)
DIPLOMA_WRONG_WORK_SIZE = (
    "Пожалуйста, уточни детали по предыдущему пункту. Нужно конкретное значение вроде \"54\" или \"108 страниц\"."
)
DIPLOMA_ASK_OTHER_REQUIREMENTS = (
    "Следующий вопрос: есть ли какие-то конкретные требования или стандарты, которые ты хотел бы учесть при написании "
    "дипломной работы? Можно предложить разные варианты. Например, количество глав, наличие введения, заключения, "
    "стандарты ГОСТ."
)
DIPLOMA_ASK_INFORMATION_SOURCE = (
    "Хочешь ли ты, чтобы я использовал какие-либо конкретные источники, или ссылки на исследования? "
    "Если да, то укажи пожалуйста ссылки на них."
)
DIPLOMA_ASK_ANY_INFORMATION = (
    "Прекрасно! Теперь у меня есть основная информация для твоей дипломной работы. Если есть любые дополнительные "
    "пожелания, комментарии или специфические требования, которые ты хотел бы учесть при написании работы, "
    "пожалуйста, напиши их здесь."
)
DIPLOMA_ASK_ACCEPT_PLAN_FIRST_PART = (
    "Прежде чем я начну составление твоей дипломной работы, давай предварительно рассмотрим ее план:\n\n"
)
DIPLOMA_ASK_ACCEPT_PLAN_SECOND_PART = (
    "Если ты хочешь сгенерировать новый план, просто нажми на соответствующую кнопку. Или можешь оставить текущий план,"
    " если он тебе подходит."
)
DIPLOMA_ASK_ACCEPT_TEXT_STRUCTURE = (
    "Теперь мы будем идти по пунктам этого плана, в которых я буду представлять тебе варианты текста. "
    "Если что-либо не нравится - всегда можешь попросить сгенерировать по новой."
)
DIPLOMA_DIALOG_IS_OVER = (
    "Поздравляю с завершением  дипломной работы! Если у тебя возникнут вопросы, или потребуется дополнительная "
    "помощь, не стесняйся обращаться ко мне снова. Жду новых вызовов от тебя!"
)
