"""Сообщения для пользователя при заказе реферата."""

REPORT_WELCOME_MESSAGE = (
    "Привет! Я - Examoff, твой верный компаньон в образовательном путешествии. "
    "Работаем с рефератом, отлично!"
    "Дальше мы пройдемся по вопросам, которые помогут нам составить все качественно, если считаешь некоторые из "
    "них ненужными - можно пропускать."
)
REPORT_ASK_THEME = (
    "Сперва, давай определимся с темой реферата."
)
REPORT_ASK_WORK_SIZE = (
    "Отлично, теперь давай определимся с объемом работы. Пожалуйста, укажи количество страниц, которое ты "
    "считаешь оптимальным.  Используй для этого пожалуйста простое, числовое значение. "
)
REPORT_WRONG_WORK_SIZE = (
    "Пожалуйста, уточни детали по предыдущему пункту. Нужно конкретное числовое значение вроде \"12\" или \"43\"."
)
REPORT_ASK_ASPECTS_ANALYSIS = (
    "Для того, чтобы сделать все как надо, мне нужно чуть больше информации. Пожалуйста, можешь указать то, "
    "на каких примерах будет проводиться анализ? По сути, мне нужно понимать - на каких аспектах и деталях ты "
    "бы хотел сосредоточиться?"
)
REPORT_ASK_ANALYSIS_TYPE = (
    "Отлично! Теперь мне нужно понять следующее - какой уровень анализа тебе необходим? Это может быть "
    "поверхностный анализ, в котором все представляется довольно обзорно, или же тебе нужен углубленный "
    "анализ, с собственными предложениями по теме."
)
REPORT_ASK_WRITING_STYLE = (
    "Отлично! Теперь мне осталось лишь уточнить стилистику составляемого реферата. Какую бы стилистику ты "
    "бы предпочел? Я работаю со всеми основными вариантами, будь то: научная, публицистическая, официально "
    "деловая и т.п."
)
REPORT_WRONG_WRITING_STYLE = (
    "Можешь по конкретнее уточнить какую именно стилистику мне использовать? Достаточно и простого: "
    "\"технический\", или \"художественный\""
)
REPORT_ASK_ANY_INFORMATION = (
    "Теперь у меня есть основная информация для твоего реферата. Если есть любые дополнительные пожелания, "
    "комментарии или специфические требования, которые ты хотел бы учесть при написании работы, пожалуйста, "
    "напиши их здесь."
)
REPORT_ASK_ACCEPT_TEXT_STRUCTURE = (
    "Теперь мы будем идти по отдельным кускам реферата, в которых я буду представлять тебе варианты текста. "
    "Если что-либо не нравится - всегда можешь попросить сгенерировать по новой."
)
REPORT_DIALOG_IS_OVER = (
    "Поздравляю с готовым рефератом! Если у тебя возникнут вопросы, или потребуется дополнительная помощь, "
    "не стесняйся обращаться ко мне снова. Жду новых вызовов от тебя!"
)