## Writing States
WRITING_WELCOME_MESSAGE = (
    "Значит, работаем с сочинением, приступим!\n"
    "Дальше мы пройдемся по вопросам, которые помогут нам составить все качественно, если считаешь некоторые из "
    "них ненужными - можно пропускать."
)
WRITING_ASK_THEME = (
    "Отлично, теперь давай определимся с объемом работы. Пожалуйста, количество слов, которое ты считаешь оптимальным."
)
WRITING_ASK_WORK_SIZE = (
    "Пожалуйста, уточни детали по предыдущему пункту. Нужно конкретное значение вроде \"54\" или \"108 слов\"."
)
WRITING_WRITING_ASK_OTHER_REQUIREMENTS = (
    "Следующий вопрос: есть ли какие-то конкретные требования или стандарты, которые ты хотел бы учесть при "
    "написании сочинения? Можно предложить разные варианты, Например, количество глав, наличие введения, заключения, "
    "стандарты ГОСТ, и даже шрифты."
)

WRITING_ASK_INFORMATION_SOURCE = (
    "Хочешь ли ты, чтобы я использовал какие-либо конкретные источники, или ссылки на исследования? Если да, то "
    "укажи пожалуйста ссылки на них."
)
WRITING_ASK_WRITING_STYLE = (
    "Отлично! Теперь мне осталось лишь уточнить стилистику составляемого сочинения. Какую бы стилистику ты "
    "бы предпочел? Я работаю со всеми основными вариантами, будь то: научная, публицистическая,"
    " официально деловая и т.п."
)
WRITING_ASK_ANY_INFORMATION = (
    "Теперь у меня есть основная информация для твоего сочинения. Если есть любые дополнительные пожелания, "
    "комментарии или специфические требования, которые ты хотел бы учесть при написании работы, "
    "пожалуйста, напиши их здесь."
)
WRITING_ASK_ACCEPT_TEXT_STRUCTURE = (
    "Иии, вот твое сочинение!. Если что-либо не нравится - всегда можешь попросить сгенерировать по новой."
)
WRITING_DIALOG_IS_OVER = (
    "Поздравляю с готовым сочинением! Если у тебя возникнут вопросы, или потребуется дополнительная помощь, не "
    "стесняйся обращаться ко мне снова. Жду новых вызовов от тебя!"
)
